---
kind: property
id: P:Autodesk.Revit.DB.NumericRevisionSettings.StartNumber
source: html/4ee6d5d4-5096-53c9-e911-683c0dd3063a.htm
---
# Autodesk.Revit.DB.NumericRevisionSettings.StartNumber Property

The start number for the sequence.

## Syntax (C#)
```csharp
public int StartNumber { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for number is negative.